class Product{
  final int id, price;
  final String title, subTitle, description, image;
//we create constructor
  Product(
      {required this.id,
        required this.price,
        required this.title,
        required this.subTitle,
        required this.description,
        required this.image});
}
// list of products
List<Product> products = [
  Product(
    id: 1,
    price: 10,
    title: " Aloe Vera ",
    subTitle: " ينمو في المناخ الجاف ويخزن الماء في أوراقه السميكة",
    image: "images/aloe-plant.png",
    description:
    "يعتبر صبار الاوفيرا من النباتات سريعة النمو نسبيًا. ولكن نموه يتوقف أو يقل في الشتاء فهو فترة السكون بالنسبة للنبات. لا يروى إلا بعد جفاف التربة لأن كثرة الماء هي السبب لمعظم مشاكل الالوفيرا",
  ),
  Product(
    id: 2,
    price: 13,
    title: "Areca",
    subTitle: "تحتاج لتربة جيدة التصريف متوسطة إلى خفيفة، وذات رطوبة لا تصل لمرحلة الندى",
    image: "images/Areca-plant.png",
    description:
     "نخيل أريكا نبتة محبة للرطوبة لذلك يفضل رش الأوراق برذاذ الماء بشكل منتظم يجب تغيير الحوض لحوض أكبر عند امتلاء الحوض بالجذور ويكون ذلك كل سنتين إلى ثلاث سنوات",
  ),
  Product(
    id: 3,
    price: 8,
    title: "Cactus",
    subTitle: "يمكن زراعته في الأماكن النصف ظليلة بشرط عدم الإسراف في ماء الري والزراعة في تربة جيدة الصرف",
    image: "images/cactus-plant.png",
    description:
    "تحتاج جو دافئ، طوال السنة عدا فصل الشتاء فتحب البرودة محبة للإضاءة الساطعة المباشرة شتاءً، وغير المباشرة صيفاً تروى طوال السنة ويشترط عند الري جفاف التربة تمامًا ويمكنها البقاء دون ماء لفترات طويلة لذلك تعتبر من النباتات التي لا تحتاج الكثير من العناية بل قد تكان معدومة العناية",
  ),
  Product(
    id: 4,
    price: 20,
    title: "Calathea",
    subTitle: "محبة للدفء فيجب أن لا تقل الحرارة عن 15 درجة مئوية شتاءً، وتحب الإضاءة الخافتة",
    image: "images/calathea-plant.png",
    description:
    "محبة للدفء فيجب أن لا تقل الحرارة عن 15 درجة مئوية شتاءً، وتحب الإضاءة الخافتة عدا الشتاء تعرض لضوء ساطع وليس لأشعة الشمس المباشرة محب للرطوبة فيجب أن تبقى التربة رطبة باستمرار ويفضل رش النبتة بالرذاذ عدة مرات يومياً خلال الصيف، وتوضع فوق صينية من الحصى المبلل بالماء، تروى بغزارة عدا الشتاء فيقلل الري،",
  ),
  Product(
    id: 5,
    price: 18,
    title: "Monstera ",
    subTitle: "يناسبها درجة حرارة الغرفة، فهي محبة للمناخ الدافئ ويمكن أن تعيش في درجات حرارة منخفضه ",
    image: "images/monstera-plant.png",
    description:
    "تحتاج للري بشكل منتظم ويفضل ريها فور جفاف التربة بشكل بسيط وتعطى السماد خلال فترة النمو النشط كل شهر تقريباً وتحب نبتة القفص الصدري الرطوية لذلك يفضل رش النبتة باستمرار بالرذاذ على فترات متقاربة خاصةً في الصيف",
  ),
  Product(
    id: 6,
    price: 15,
    title: "Rubber",
    subTitle: "يحتاج ضوء ساطع  مرشح، وحرارة معتدلة ",
    image: "images/rubber-plant.png",
    description:
    "ويروى باعتدال خلال فترة النمو النشط  التي تمثل أغلب السنة عدا فصل الشتاء فيقلل الري لأنها فترة سكون ويسمد كل أسبوعين خلال فترة النمو النشط.",
  ),

  Product(
    id: 7,
    price: 10,
    title: "ٍٍSpider",
    subTitle: "المدى الحراري المثالي لنمو هذه الشجيرة بشكل جيد ينحصر بين 18 إلى 25 درجة مئوية",
    image: "images/spider-plant.png",
    description:
    "لتربيتها داخل المنزل في بيئتنا من المهم لنموها أيضاً بشكل جيد توفير الضوء الجيد داخل المنزل كونها محبة للضوء بشرط عدم التعرض لأشعة الشمس المباشرة إلا خلال فصل الشتاء، وتحتاج ري غزير يقلل في الشتاء وتسمد كل أسبوعين",
  ),
  Product(
    id: 8,
    price: 7,
    title: "Umbrella",
    subTitle: " تتربي في ضوء متوسط و لكن الضوء العالي أفضل ",
    image: "images/umbrella-plant.png",
    description:
    "نبات محب للرطوبة لذلك ينبغي رشه برذاذ الماء بانتظام تروى الشفليرا بعد جفاف السطح العلوي للتربة بمقدار 2-3سم ويزود النبات بالسماد خلال فترة الصيف بانتظام",
  ),
];